; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	thermograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph0)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 infrared1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
	(supports instrument9 infrared1)
	(supports instrument9 thermograph2)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation5)
	(supports instrument10 thermograph2)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared1)
	(calibration_target instrument10 GroundStation6)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph0)
	(supports instrument11 infrared1)
	(calibration_target instrument11 GroundStation0)
	(supports instrument12 thermograph2)
	(supports instrument12 thermograph0)
	(supports instrument12 infrared1)
	(calibration_target instrument12 Star4)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 GroundStation6)
	(supports instrument13 thermograph2)
	(supports instrument13 thermograph0)
	(supports instrument13 infrared1)
	(calibration_target instrument13 Star3)
	(calibration_target instrument13 GroundStation0)
	(on_board instrument13 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation0)
)
(:goal (and
	(pointing satellite3 GroundStation5)
	(pointing satellite7 Star3)
	(have_image Phenomenon7 thermograph2)
	(have_image Planet8 thermograph2)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 thermograph0)
	(have_image Planet11 thermograph2)
	(have_image Phenomenon12 thermograph0)
))

)

; plan
1. (switch_on instrument13 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument13)
   goals met: 0 of 8
2. (calibrate satellite7 instrument13 groundstation0)
   added: (calibrated instrument13)
   goals met: 0 of 8
3. (turn_to satellite7 planet10 groundstation0)
   deleted: (pointing satellite7 groundstation0)
   added: (pointing satellite7 planet10)
   goals met: 0 of 8
4. (take_image satellite7 planet10 instrument13 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite7 phenomenon9 planet10)
   deleted: (pointing satellite7 planet10)
   added: (pointing satellite7 phenomenon9)
   goals met: 1 of 8
6. (take_image satellite7 phenomenon9 instrument13 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 2 of 8
7. (turn_to satellite7 phenomenon7 phenomenon9)
   deleted: (pointing satellite7 phenomenon9)
   added: (pointing satellite7 phenomenon7)
   goals met: 2 of 8
8. (take_image satellite7 phenomenon7 instrument13 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 3 of 8
9. (turn_to satellite7 phenomenon12 phenomenon7)
   deleted: (pointing satellite7 phenomenon7)
   added: (pointing satellite7 phenomenon12)
   goals met: 3 of 8
10. (take_image satellite7 phenomenon12 instrument13 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 4 of 8
11. (turn_to satellite3 groundstation5 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 groundstation5)
   goals met: 5 of 8
12. (turn_to satellite7 planet11 phenomenon12)
   deleted: (pointing satellite7 phenomenon12)
   added: (pointing satellite7 planet11)
   goals met: 5 of 8
13. (take_image satellite7 planet11 instrument13 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 6 of 8
14. (turn_to satellite7 planet8 planet11)
   deleted: (pointing satellite7 planet11)
   added: (pointing satellite7 planet8)
   goals met: 6 of 8
15. (take_image satellite7 planet8 instrument13 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 7 of 8
16. (turn_to satellite7 star3 planet8)
   deleted: (pointing satellite7 planet8)
   added: (pointing satellite7 star3)
   goals met: 8 of 8
